using System;
using System.Collections.Generic;
using System.Diagnostics;
using System.Linq;
using System.Threading.Tasks;
using Microsoft.AspNetCore.Mvc;
using Microsoft.Extensions.Logging;
using ArtsNamespace.Models;

namespace lab1_2.Controllers
{
    public class ArtController : Controller
    {
        ArtDbContext _context;
        public ArtController(ArtDbContext context) {
            _context = context;
        }
        [HttpGet]
        public IActionResult Index()
        {
            var Albums = _context.Album.ToList();

            return View(Albums);
        }
        [HttpPost]
        public IActionResult Index(string straight)
        {
            string result = "";
            switch(straight)
            {
                case "Абстрактний експресіонізм":
                    result += "Абстрактний експресіонізм — рух в абстрактному мистецтві, що акцентує увагу на процесі живопису, властивостях самого процесу малювання і взаємодії художника, фарби і полотна. Абстрактний експресіонізм зародився в Нью-Йорку на початку 1940. Його представники — Аршиль Горкі, Франц Кляйн, Джексон Поллок, Марк Ротко і Агнес Мартін.";
                    break;
                case "Стріт-арт":
                    result += "Стрит-арт або стріт-арт (англ. Street art — вуличне мистецтво) — образотворче мистецтво, характерною особливістю якого є яскраво виражений урбаністичний стиль. Основна частина стрит-арта - графіті (спрей-арт), але не можна ототожнювати графіті і стрит-арт. До стрит-арту належать також постери (некомерційні), трафарети тощо.";
                    break;
                case "Концептуальне мистецтво":
                    result += @"Концептуальне мистецтво - мистецький рух постмодернізму, що склався в кінці 1960-х років під впливом дадаїстів, майстрів поп-арту й мінімального мистецтва. Концептуалісти ставлять своїм завданням перехід мистецтва від виконання художніх творів до вільних від матеріального втілення «художніх ідей» (т. з. концептів — загальних уявлень). Творчість осмислюється концептуалістами як близький по духу хеппенінгу, але статично зафіксований процес залучення глядача в «гру ідей». Це оформляється у вигляді графіків, діаграм, схем, цифр, формул, написів тощо." +
                                "Яскравими представниками українського концептуалізму є Фонд Мазоха та Олег Тістол.";
                    break;
            }
            return Content(result);
        }

    }
}
